var localDataBase = [{
    touxiangUrl: "../../images/touxiang.png",
    date: new Date().toLocaleDateString(),
    imageUrl: "../../images/111.jpg",
    content: "《镇魂街》是由许辰在有妖气原创漫画梦工厂独家签约连载的网络漫画。 [1]  2012年1月开始由吉林美术出版社发售漫画单行本，中国香港由影文化传播有限公司发售漫画单行本。",
    favorNum: 23,
    commentNum: 12,
    postId:0
  },
  {
    touxiangUrl: "../../images/touxiang.png",
    date: new Date().toLocaleDateString(),
    imageUrl: "../../images/222.jpg",
    content: "镇魂街，此乃吸纳亡灵镇压恶灵之地。这是一个人灵共存的世界，但不是每个人都能进入镇魂街，只有拥有守护灵的寄灵人才可进入。夏铃原本是一名普通的大学实习生，但一次偶然导致她的人生从此不再平凡。在这个充满恶灵的世界，你能与你的守护灵携手生存下去吗？",
    favorNum: 66,
    commentNum: 35,
    postId: 1
  },
  {
    touxiangUrl: "../../images/touxiang.png",
    date: new Date().toLocaleDateString(),
    imageUrl: "../../images/333.jpg",
    content: "《大圣归来》《大鱼海棠》《大护法》……近几年，国产动画出现了许多让人眼前一亮的作品。 不过，除了这些热门动画以外，还有许多精品国产动漫却不被大家所提及。今天就推荐一部还没有那",
    favorNum: 12,
    commentNum: 9,
    postId: 2
  }


]

var postDetailData=[
  {
    touxiangUrl: "../../../images/touxiang.png",
    imageUrl: "../../../images/111.jpg",
    content: "好久没写影评了，还是不太会写。好久没有一口气看完一个番了（突然想起弹幕里说一口气真长2333），因为真的很喜欢，完全停不下。弹幕里的剧透党太烦人了。还有刷末将于禁，愿为曹家世代赴汤蹈火的人。。。emmm好像变成吐槽了。。。 说到于禁，真的很感动呀，虽然弹幕里很烦，但是听到那句话，还是会动容。可惜挂的太早了😭😭😭我是先看完阴版又看的阳版，感觉这个顺序看过来比较容易理解剧情。动画画面很棒，感觉打斗场景也很流畅，就是有些台词太中二了，也许是因为主角那是还是小孩子？后期的台词剧本仿佛经费不足的样子，不如前期精彩了。总体来说还是很满意的。对了，忘了一句，每一集太短啦！完全不够看！期待第二季，期待国产动画的崛起",
    postId: 0
  },
  {
    touxiangUrl: "../../../images/touxiang.png",
    imageUrl: "../../../images/222.jpg",
    content: "看镇魂街，是因为微博首页一个小姐姐的安利。以我的记性，过了这么久要来写影评是有点困难的。但是还是想记录一下，刚看了一下豆瓣第二季要12月（准吗？）真的是一口气刷完了一季，觉得真的很好看，很热血，国漫也很棒啊，bgm 都特别的好听！！！极力推荐bgm!剧情设定我也很喜欢（除去女主）父子情~兄弟情~主仆情就是那个守护灵的名字啊，最后的boss 的名字竟然是“李轩辕”这。。。。谁？前面于禁，许褚，燕青这个就知道，李轩辕这名字不太大气啊（我也懒百度了）总之就是很不错啦。挺喜欢的",
    postId: 1
  },
  {
    touxiangUrl: "../../../images/touxiang.png",
    imageUrl: "../../../images/333.jpg",
    content: "卢恒宇和李姝洁工作室是国内最卖座的动画工作室，《十万个冷笑话》开启了中国网络动画时代，而《十万个冷笑话》电影版更是取得了1.19亿的票房。但《镇魂街》内容相比《十万个冷笑话》复杂了很多，以之前的团队规模恐怕没有能力把《镇魂街》完美地表现出来。卢导在接手项目后意识到了这个问题，于是在这一年中，一边制作，一边不断扩充团队，3D部门也在这时组建，片中有一些复杂镜头运动就是通过3D技术进行实现，同理部分远景动作。卢导在采访中说，“有些镜头用二维动画表现会有限制，在适当的环节运用3D做配合是我们今年做出的一个技术尝试，我们未来也希望能做出画质更加精良的影片给观众老爷看，当然也包括3D的动画电影。”工作室在人员扩充之后，规模已经达到90多人，目前是国内顶级规模的动画公司之一，制作实力早已不可同日而语。卢恒宇和李姝洁工作室花了一整年全力制作的《镇魂街》，可谓蓄力之作。完成《镇魂街》之后，团队将全力投入到《十万个冷笑话》大电影2的制作。",
    postId: 2
  }
]

module.exports = {
  data: localDataBase,
  data2: postDetailData
}